using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class GunDeta : MonoBehaviour
{
    public static string[] BNa = new string[100];
    public static float[,] BSt = new float[100, 15];
    public static bool[] BKaihou = new bool[100];
    public static int[] Buki = { 0, 1, 2, 3 };
    public Texture[] GunTextures = new Texture[100];
    void Start()
    {
        //初期化
        /*
        for (int i = 0; i <= 99; i++)
        {
            BKaihou[i] = true;
        }
        */
        //000番は最初から所持
        BKaihou[0] = true;
        //弾丸のデータを取得
        (BSt, BNa) = BulletDeta();
    }

    // Update is called once per frame
    void Update()
    {

    }
    public Texture GunTexture(int i)
    {
        //指定された番号の銃のテクスチャを返す
        return GunTextures[i];
    }

    public (float[], string) BulletDetaGet(int i)
    {
        //指定された番号の銃のステータスを返す
        float[] iBSt = new float[15];
        string iBNa;
        for (int j = 0; j < 15; j++)
        {
            iBSt[j] = BSt[i, j];
        }
        iBNa = BNa[i];
        return (iBSt, iBNa);
    }

    public (float[,], string[]) BulletDeta()
    {
        int i = 0;
        //000スピア
        BNa[i] = "スピア";
        BSt[i, 0] = 25;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 4;//連射力
        BSt[i, 4] = 1;//装填数
        BSt[i, 5] = 0;//リロード速度
        BSt[i, 6] = 6;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 0;//精度
        BSt[i, 10] = 10;//射程
        BSt[i, 11] = 4;//弾丸の種類
        BSt[i, 12] = 4;//発射音
        BSt[i, 13] = 4;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;        
        //001ショートボウ
        BNa[i] = "ショートボウ";
        BSt[i, 0] = 55;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 1;//連射力
        BSt[i, 4] = 1;//装填数
        BSt[i, 5] = 0;//リロード速度
        BSt[i, 6] = 10;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 0;//精度
        BSt[i, 10] = 500;//射程
        BSt[i, 11] = 5;//弾丸の種類
        BSt[i, 12] = 4;//発射音
        BSt[i, 13] = 4;//切り替え音
        BSt[i, 14] = 3;//弾丸の軌道
        i++;
        //002ハンドガン
        BNa[i] = "ハンドガン";
        BSt[i, 0] = 20;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 3;//連射力
        BSt[i, 4] = 12;//装填数
        BSt[i, 5] = 0.5f;//リロード速度
        BSt[i, 6] = 8;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 15;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 1;//弾丸の種類
        BSt[i, 12] = 1;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        //003マグナム
        BNa[i] = "マグナム";
        BSt[i, 0] = 50;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 2;//ノックバック
        BSt[i, 3] = 1;//連射力
        BSt[i, 4] = 6;//装填数
        BSt[i, 5] = 1.5f;//リロード速度
        BSt[i, 6] = 25;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 0;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 2;//弾丸の種類
        BSt[i, 12] = 3;//発射音
        BSt[i, 13] = 3;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        //004ラットショットピストル
        BNa[i] = "ラットショットピストル";
        BSt[i, 0] = 25;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 1.5f;//連射力
        BSt[i, 4] = 6;//装填数
        BSt[i, 5] = 1f;//リロード速度
        BSt[i, 6] = 60;//弾速
        BSt[i, 7] = 1;//発射方式
        BSt[i, 8] = 4;//発射数
        BSt[i, 9] = 25;//精度
        BSt[i, 10] = 10;//射程
        BSt[i, 11] = 0;//弾丸の種類
        BSt[i, 12] = 2;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        //005マシンピストル
        BNa[i] = "マシンピストル";
        BSt[i, 0] = 12;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 8;//連射力
        BSt[i, 4] = 24;//装填数
        BSt[i, 5] = 1f;//リロード速度
        BSt[i, 6] = 30;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 20;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 0;//弾丸の種類
        BSt[i, 12] = 0;//発射音
        BSt[i, 13] = 0;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        //006二丁拳銃
        BNa[i] = "二丁拳銃";
        BSt[i, 0] = 20;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 2;//連射力
        BSt[i, 4] = 6;//装填数
        BSt[i, 5] = 1;//リロード速度
        BSt[i, 6] = 120;//弾速
        BSt[i, 7] = 2;//発射方式
        BSt[i, 8] = 2;//発射数
        BSt[i, 9] = 15;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 1;//弾丸の種類
        BSt[i, 12] = 1;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        //007デザートイーグル
        BNa[i] = "デザートイーグル";
        BSt[i, 0] = 100;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 3;//ノックバック
        BSt[i, 3] = 0.6f;//連射力
        BSt[i, 4] = 6;//装填数
        BSt[i, 5] = 2f;//リロード速度
        BSt[i, 6] = 80;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 10;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 3;//弾丸の種類
        BSt[i, 12] = 3;//発射音
        BSt[i, 13] = 3;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        //008モロトフカクテル
        BNa[i] = "モロトフカクテル";
        BSt[i, 0] = 60;//威力
        BSt[i, 1] = 1;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 0.6f;//連射力
        BSt[i, 4] = 1;//装填数
        BSt[i, 5] = 0;//リロード速度
        BSt[i, 6] = 20;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 10;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 4;//弾丸の種類
        BSt[i, 12] = 1;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 2;//弾丸の軌道
        i++;
        //009雪合戦
        BNa[i] = "雪合戦";
        BSt[i, 0] = 60;//威力
        BSt[i, 1] = 2;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 2;//ノックバック
        BSt[i, 3] = 1;//連射力
        BSt[i, 4] = 5;//装填数
        BSt[i, 5] = 1.2f;//リロード速度
        BSt[i, 6] = 20;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 10;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 5;//弾丸の種類
        BSt[i, 12] = 3;//発射音
        BSt[i, 13] = 3;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        //010スタンガン
        BNa[i] = "スタンガン";
        BSt[i, 0] = 8;//威力
        BSt[i, 1] = 3;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 0;//ノックバック
        BSt[i, 3] = 12;//連射力
        BSt[i, 4] = 30;//装填数
        BSt[i, 5] = 1f;//リロード速度
        BSt[i, 6] = 40;//弾速
        BSt[i, 7] = 1;//発射方式
        BSt[i, 8] = 2;//発射数
        BSt[i, 9] = 25;//精度
        BSt[i, 10] = 4;//射程
        BSt[i, 11] = 1;//弾丸の種類
        BSt[i, 12] = 0;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        //011壊れたレーザー銃
        BNa[i] = "壊れたレーザー銃";
        BSt[i, 0] = 30;//威力
        BSt[i, 1] = 4;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 3;//連射力
        BSt[i, 4] = 4;//装填数
        BSt[i, 5] = 1.5f;//リロード速度
        BSt[i, 6] = 20;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 0;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 2;//弾丸の種類
        BSt[i, 12] = 4;//発射音
        BSt[i, 13] = 0;//切り替え音
        BSt[i, 14] = 1;//弾丸の軌道
        i++;
        //012グレネード
        BNa[i] = "グレネード";
        BSt[i, 0] = 100;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 0.5f;//連射力
        BSt[i, 4] = 1;//装填数
        BSt[i, 5] = 0f;//リロード速度
        BSt[i, 6] = 25;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 5;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 6;//弾丸の種類
        BSt[i, 12] = 1;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 2;//弾丸の軌道
        i++;
        //013焼夷グレネード
        BNa[i] = "焼夷グレネード";
        BSt[i, 0] = 100;//威力
        BSt[i, 1] = 1;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 0.5f;//連射力
        BSt[i, 4] = 1;//装填数
        BSt[i, 5] = 0;//リロード速度
        BSt[i, 6] = 25;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 5;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 7;//弾丸の種類
        BSt[i, 12] = 1;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 2;//弾丸の軌道
        i++;
        //014液体窒素グレネード
        BNa[i] = "液体窒素グレネード";
        BSt[i, 0] = 100;//威力
        BSt[i, 1] = 2;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 0.5f;//連射力
        BSt[i, 4] = 1;//装填数
        BSt[i, 5] = 0;//リロード速度
        BSt[i, 6] = 25;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 5;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 8;//弾丸の種類
        BSt[i, 12] = 1;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 2;//弾丸の軌道
        i++;
        //015EMPグレネード
        BNa[i] = "EMPグレネード";
        BSt[i, 0] = 100;//威力
        BSt[i, 1] = 3;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 0.5f;//連射力
        BSt[i, 4] = 1;//装填数
        BSt[i, 5] = 0;//リロード速度
        BSt[i, 6] = 25;//弾速
        BSt[i, 7] = 0;//発射方式
        BSt[i, 8] = 1;//発射数
        BSt[i, 9] = 5;//精度
        BSt[i, 10] = 120;//射程
        BSt[i, 11] = 9;//弾丸の種類
        BSt[i, 12] = 1;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 2;//弾丸の軌道
        i++;
        //999チート
        BNa[i] = "???";
        BSt[i, 0] = 200;//威力
        BSt[i, 1] = 0;//属性[無 炎 氷 雷 魔]
        BSt[i, 2] = 1;//ノックバック
        BSt[i, 3] = 12f;//連射力
        BSt[i, 4] = 32;//装填数
        BSt[i, 5] = 1;//リロード速度
        BSt[i, 6] = 40;//弾速
        BSt[i, 7] = 1;//発射方式
        BSt[i, 8] = 10;//発射数
        BSt[i, 9] = 25;//精度
        BSt[i, 10] = 180;//射程
        BSt[i, 11] = 2;//弾丸の種類
        BSt[i, 12] = 1;//発射音
        BSt[i, 13] = 1;//切り替え音
        BSt[i, 14] = 0;//弾丸の軌道
        i++;
        return (BSt, BNa);
    }
}
